{
    "200": {
        "1000": "OK"
    },
    "201": {
        "1000": "Created"
    },
    "202": {
        "1000": "Accepted"
    },
    "204": {
        "1000": "No Content"
    },
    "301": {
        "1000": "Moved Permanently"
    },
    "303": {
        "1000": "See Other"
    },
    "304": {
        "1000": "Not Modified"
    },
    "307": {
        "1000": "Temporary Redirect"
    },
    "308": {
        "1000": "Permanent Redirect"
    },
    "400": {
        "1000": "Bad Request",
        "1001": "Missing Required Credential",
        "1002": "Invalid Site Code Provided",
        "1003": "Missing site information from session or request",
        "1004": "Missing name.full parameter",
        "1005": "Missing last5 parameter",
        "1006": "Missing pid parameter",
        "1007": "Invalid Pid. Please pass either ICN or Primary Site ID.",
        "1008": "Query parameters must not conflict with body fields. All query parameters must be present as body fields.",
        "1009": "This resource must be accessed with a POST request and an X-HTTP-Method-Override request header",
        "1010": "This resource must be accessed with a POST request and the X-HTTP-Method-Override: GET request header",
        "1011": "This resource must be accessed with a POST request and the X-HTTP-Method-Override: PUT request header",
        "1012": "This resource must be accessed with a POST request and the X-HTTP-Method-Override: DELETE request header",
        "1013": "This resource must be accessed with a POST request and the X-HTTP-Method-Override: PATCH request header",
        "1020": "Missing permission sets",
        "1021": "Invalid JSON: unable to parse string",
        "1022": "Missing mode parameter",
        "1023": "Invalid Multi-user edit mode",
        "1024": "Missing uid",
        "1025": "Missing user uid",
        "1026": "Missing user parameter",
        "1027": "Invalid Pid. Please pass either ICN, Primary Site PID or Secondary Site PID.",
        "1028": "Bad filter argument passed in"
    },
    "401": {
        "1000": "Unauthorized",
        "1001": "No Result",
        "1002": "No session could be established. Please log in."
    },
    "403": {
        "1000": "Forbidden",
        "1001": "You are not an authorized user of eHMP. Please contact your local access control coordinator (ACC) for assistance.",
        "1002": "Not allowed to edit permission sets on this user"
    },
    "404": {
        "1000": "Not Found"
    },
    "406": {
        "1000": "Not Acceptable"
    },
    "409": {
        "1000": "Conflict"
    },
    "410": {
        "1000": "Gone"
    },
    "412": {
        "1000": "Precondition Failed"
    },
    "415": {
        "1000": "Unsupported Media Type"
    },
    "500": {
        "1000": "Internal Server Error",
        "1001": "There was an error trying to regenerate an express session for a new user",
        "1002": "Error destroying session",
        "1003": "Could not locate session to end",
        "1004": "Could not locate session to refresh",
        "1005": "Could not retrieve the requested configuration",
        "1006": "Could not save tracker information to external server",
        "1007": "Error saving incident file",
        "1008": "Error saving incident file. Server misconfiguration. Incident saved in resource server log.",
        "1009": "Error saving incident file. Internal server directory permission error. Incident saved in resource server log.",
        "1010": "Error saving incident file. Internal server file permission error. Incident saved in resource server log.",
        "1011": "Error saving incident file. Internal server execution error. Incident saved in resource server log.",
        "1012": "Error saving incident file. NFS export not mounted. Incident saved in resource server log.",
        "1013": "Error gathering sync meta stamp for incident file. Incident file saved anyway.",
        "1014": "Error gathering sync status for incident file. Incident file saved anyway.",
        "1015": "Error sending incident notification email. Invalid server email configuration: missing \"to\" and \"from\". Incident file saved anyway.",
        "1016": "Error sending incident notification email. Recipient rejected email. Incident file saved anyway.",
        "1017": "Error sending incident notification email. Incident file saved anyway.",
        "1018": "Error sending incident notification email. Invalid server email configuration: missing \"to\". Incident file saved anyway.",
        "1019": "Error sending incident notification email. Invalid server email configuration: missing \"from\". Incident file saved anyway.",
        "1020": "Error retrieving the users given permissions and permission sets.",
		"1021": "Failed to successfully read the eHMP versions file.",
        "1022": "Your search is too complex. For better results, please reduce the number of terms and search again."
    },
    "502": {
        "1000": "Bad Gateway"
    },
    "503": {
        "1000": "Service Unavailable"
    }
}
