{"name":"jenkins","version":"5.0.1","description":"Installs and configures Jenkins CI master & slaves","long_description":"# jenkins Cookbook\n\n[![Build Status](https://travis-ci.org/chef-cookbooks/jenkins.svg?branch=master)](https://travis-ci.org/chef-cookbooks/jenkins) [![Cookbook Version](https://img.shields.io/cookbook/v/jenkins.svg)](https://supermarket.chef.io/cookbooks/jenkins)\n\nInstalls and configures Jenkins CI master & node slaves. Resource providers to support automation via jenkins-cli, including job create/update.\n\n## Requirements\n\n### Platforms\n\n- Debian/Ubuntu\n- RHEL/CentOS/Scientific/Amazon/Oracle\n\n### Chef\n\n- Chef 12.1+\n\n### Cookbooks\n\n- compat_resource\n- runit\n\n#### Java cookbook\n\nThis cookbook does not install, manage, or manipulate a JDK, as that is outside of the scope of Jenkins. The `package` installation method will automatically pull in a valid Java if one does not exist on Debian. RHEL jenkins packages do not depend on java as there are far too many options for a package to do the right thing. We recommend including the java cookbook on your system which allows for either openJDK or Oracle JDK installations.\n\n## Attributes\n\nIn order to keep the README manageable and in sync with the attributes, this cookbook documents attributes inline. The usage instructions and default values for attributes can be found in the individual attribute files.\n\n## Examples\n\nDocumentation and examples are provided inline using YARD. The tests and fixture cookbooks in `tests` and `tests/fixtures` are intended to be a further source of examples.\n\n## Recipes\n\n### master\n\nThe master recipe will create the required directory structure and install jenkins. There are two installation methods, controlled by the `node['jenkins']['master']['install_method']` attribute:\n\n- `package` - Install Jenkins from the official jenkins-ci.org packages\n- `war` - Download the latest version of the WAR file and configure it with Runit\n\n## Resource/Provider\n\n### jenkins_command\n\nThis resource executes arbitrary commands against the [Jenkins CLI](https://wiki.jenkins-ci.org/display/JENKINS/Jenkins+CLI), supporting the following actions:\n\n```\n:execute\n```\n\n```ruby\njenkins_command 'safe-restart'\n```\n\nTo reload the configuration from disk:\n\n```ruby\njenkins_command 'reload-configuration'\n```\n\nTo prevent Jenkins from starting any new builds (in preparation for a shutdown):\n\n```ruby\njenkins_command 'quiet-down'\n```\n\n**NOTE** You must add your own `not_if`/`only_if` guards to the `jenkins_command` to prevent duplicate commands from executing. Just like Chef's core `execute` resource, the `jenkins_command` resource has no way of being idempotent.\n\n### jenkins_script\n\nThis resource executes arbitrary Java or Groovy commands against the Jenkins master. By the nature of this command, it is **not** idempotent.\n\n```ruby\njenkins_script 'println(\"This is Groovy code!\")'\n```\n\n```ruby\njenkins_script 'add_authentication' do\n  command <<-EOH.gsub(/^ {4}/, '')\n    import jenkins.model.*\n    import hudson.security.*\n    import org.jenkinsci.plugins.*\n\n    def instance = Jenkins.getInstance()\n\n    def githubRealm = new GithubSecurityRealm(\n      'https://github.com',\n      'https://api.github.com',\n      'API_KEY',\n      'API_SECRET'\n    )\n    instance.setSecurityRealm(githubRealm)\n\n    def strategy = new FullControlOnceLoggedInAuthorizationStrategy()\n    instance.setAuthorizationStrategy(strategy)\n\n    instance.save()\n  EOH\nend\n```\n\n### jenkins\\_credentials\n\n**NOTES**\n\n* Install version 1.6 or higher of the [credentials plugin](https://wiki.jenkins-ci.org/display/JENKINS/Credentials+Plugin) to use the Jenkins credentials resource.\n\n* In version `4.0.0` of this cookbook this resource was changed so that credentials are referenced by their ID instead of by their name.  If you are upgrading your nodes from an earlier version of this cookbook ( <= 3.1.1 ), use the credentials resource and do not have explicit IDs assigned to credentials, you will need to go into the Jenkins UI, find the auto-generated UUIDs for your credentials, and add them to your cookbook resources.\n\n----\n\nThis resource uses the Jenkins Groovy API to manage credentials and supports the following actions:\n\n```\n:create, :delete\n```\n\nBoth actions operate on the credential resources idempotently.  It also supports why-run mode.\n\n`jenkins_credentials` is a base resource that is not used directly.  Instead there are resources for each specific type of credentials supported.\n\n### Common attributes\n\nUse of the credential resource requires a unique `id` attribute.  The resource uses this ID to find the credential for future modifications, and it is an immutable resource once the resource is created within Jenkins.  This ID is also how you reference the credentials in other Groovy scripts (i.e. Pipeline code).\n\nThe `username` attribute (also the name attribute) corresponds to the username of the credentials on the target node.\n\nYou may also specify a `description` which is useful in credential identification.\n\n#### jenkins\\_password\\_credentials\n\nBasic username + password credentials.\n\n```ruby\n# Create password credentials\njenkins_password_credentials 'wcoyote' do\n  id          'wcoyote-password'\n  description 'Wile E Coyote'\n  password    'beepbeep'\nend\n```\n\n```ruby\n# Delete password credentials\njenkins_password_credentials 'wcoyote' do\n  id     'wcoyote-password'\n  action :delete\nend\n```\n\n#### jenkins\\_private\\_key\\_credentials\n\nCredentials that use a username + private key (optionally protected with a passphrase).\n\n```ruby\n# Create private key credentials\njenkins_private_key_credentials 'wcoyote' do\n  id          'wcoyote-key'\n  description 'Wile E Coyote'\n  private_key \"-----BEGIN RSA PRIVATE KEY-----\\nMIIEpAIBAAKCAQ...\"\nend\n\n# Private keys with a passphrase will also work\njenkins_private_key_credentials 'wcoyote' do\n  id          'wcoyote-key'\n  description 'Eile E Coyote'\n  private_key \"-----BEGIN RSA PRIVATE KEY-----\\nMIIEpAIBAAKCAQ...\"\n  passphrase  'beepbeep'\nend\n```\n\n```ruby\n# Delete private key\njenkins_private_key_credentials 'wcoyote' do\n  id     'wcoyote-key'\n  action :delete\nend\n```\n\n### jenkins\\_secret\\_text\\_credentials\n\nGeneric secret text. Requires the the `credentials-binding` plugin.\n\n```ruby\n# Create secret text credentials\njenkins_secret_text_credentials 'wcoyote' do\n  id          'wcoyote-secret'\n  description 'Wile E Coyote Secret'\n  secret      'Some secret text'\nend\n```\n\n```ruby\n# Delete secret text credentials\njenkins_secret_text_credentials 'wcoyote' do\n  id     'wcoyote-secret'\n  action :delete\nend\n```\n\n#### Scopes\n\nCredentials in Jenkins can be created with 2 different \"scopes\" which determines where the credentials can be used:\n\n- **GLOBAL** - This credential is available to the object on which the credential is associated and all objects that are children of that object. Typically you would use global-scoped credentials for things that are needed by jobs.\n- **SYSTEM** - This credential is only available to the object on which the credential is associated. Typically you would use system-scoped credentials for things like email auth, slave connection, etc, i.e. where the Jenkins instance itself is using the credential. Unlike the global scope, this significantly restricts where the credential can be used, thereby providing a higher degree of confidentiality to the credential.\n\nThe credentials created with the `jenkins_credentials` resources are assigned a `GLOBAL` scope.\n\n### jenkins_job\n\nThis resource manages Jenkins jobs, supporting the following actions:\n\n```\n:create, :delete, :disable, :enable, :build\n```\n\nThe resource is fully idempotent and convergent. It also supports why-run mode.\n\nThe `:create` action requires a Jenkins job `config.xml`. This config file must exist on the target node and contain a valid Jenkins job configuration file. Because the Jenkins CLI actually reads and generates its own copy of this file, **do NOT** write this configuration inside of the Jenkins job. We recommend putting them in Chef's file cache path:\n\n```ruby\nxml = File.join(Chef::Config[:file_cache_path], 'bacon-config.xml')\n\n# You could also use a `cookbook_file` or pure `file` resource to generate\n# content at this path.\ntemplate xml do\n  source 'custom-config.xml.erb'\nend\n\n# Create a jenkins job (default action is `:create`)\njenkins_job 'bacon' do\n  config xml\nend\n```\n\n```ruby\njenkins_job 'bacon' do\n  action :delete\nend\n```\n\nYou can disable a Jenkins job by specifying the `:disable` option. This will disable an existing job, if and only if that job exists and is enabled. If the job does not exist, an exception is raised.\n\n```ruby\njenkins_job 'bacon' do\n  action :disable\nend\n```\n\nYou can enable a Jenkins job by specifying the `:enable` option. This will enable an existing job, if and only if that job exists and is disabled. If the job does not exist, an exception is raised.\n\n```ruby\njenkins_job 'bacon' do\n  action :enable\nend\n```\n\nYou can execute a Jenkins job by specifying the `:build` option. This will run the job, if and only if that job exists and is enabled. If the job does not exist, an exception is raised.\n\n```ruby\njenkins_job 'my-parameterized-job' do\n  parameters(\n    'STRING_PARAM' => 'meeseeks',\n    'BOOLEAN_PARAM' => true,\n  )\n  # if true will live stream the console output of the executing job  (default is true)\n  stream_job_output true\n  # if true will block the Chef client run until the build is completed or aborted (defaults to true)\n  wait_for_completion true\n  action :build\nend\n```\n\n### jenkins_plugin\n\nThis resource manages Jenkins plugins, supporting the following actions:\n\n```\n:install, :uninstall, :enable, :disable\n```\n\nThis uses the Jenkins CLI to install plugins. By default, it does a cold deploy, meaning the plugin is installed while Jenkins is still running. Some plugins may require you restart the Jenkins instance for their changed to take affect.\n\n- **A plugin's dependencies are also installed by default, this behavior can be disabled by setting the `install_deps` attribute to `false`.**\n- **This resource does not install plugin dependencies from a a given hpi/jpi URL - you must specify all plugin dependencies or Jenkins may not startup correctly!**\n\nThe `:install` action idempotently installs a Jenkins plugin on the current node. The name attribute corresponds to the name of the plugin on the Jenkins Update Center. You can also specify a particular version of the plugin to install. Finally, you can specify a full source URL or local path (on the node) to a plugin.\n\n```ruby\n# Install the latest version of the greenballs plugin\njenkins_plugin 'greenballs'\n\n# Install version 1.3 of the greenballs plugin\njenkins_plugin 'greenballs' do\n  version '1.3'\nend\n\n# Install a plugin from a given hpi (or jpi)\njenkins_plugin 'greenballs' do\n  source 'http://updates.jenkins-ci.org/download/plugins/greenballs/1.10/greenballs.hpi'\nend\n\n# Don't install a plugins dependencies\njenkins_plugin 'github-oauth' do\n  install_deps false\nend\n```\n\nDepending on the plugin, you may need to restart the Jenkins instance for the plugin to take affect:\n\nPackage installation method:\n\n```ruby\njenkins_plugin 'a_complicated_plugin' do\n  notifies :restart, 'service[jenkins]', :immediately\nend\n```\n\nWar installation method:\n\n```ruby\njenkins_plugin 'a_complicated_plugin' do\n  notifies :restart, 'runit_service[jenkins]', :immediately\nend\n```\n\nFor advanced users, this resource exposes an `options` attribute that will be passed to the installation command. For more information on the possible values of these options, please consult the documentation for your Jenkins installation.\n\n```ruby\njenkins_plugin 'a_really_complicated_plugin' do\n  options '-deploy -cold'\nend\n```\n\nThe `:uninstall` action removes (uninstalls) a Jenkins plugin idempotently on the current node.\n\n```ruby\njenkins_plugin 'greenballs' do\n  action :uninstall\nend\n```\n\nThe `:enable` action enables a plugin. If the plugin is not installed, an exception is raised. If the plugin is already enabled, no action is taken.\n\n```ruby\njenkins_plugin 'greenballs' do\n  action :enable\nend\n```\n\nThe `:disable` action disables a plugin. If the plugin is not installed, an exception is raised. If the plugin is already disabled, no action is taken.\n\n```ruby\njenkins_plugin 'greenballs' do\n  action :disable\nend\n```\n\n**NOTE** You may need to restart Jenkins after changing a plugin. Because this varies on a case-by-case basis (and because everyone chooses to manage their Jenkins infrastructure differently) this LWRP does **NOT** restart Jenkins for you.\n\n### jenkins_slave\n\n**NOTE** The use of the Jenkins user resource requires the Jenkins SSH credentials plugin. This plugin is not shipped by default in jenkins 2.x.\n\nThis resource manages Jenkins slaves, supporting the following actions:\n\n```\n:create, :delete, :connect, :disconnect, :online, :offline\n```\n\nThe following slave launch methods are supported:\n\n- **JNLP/Java Web Start** - Starts a slave by launching an agent program through JNLP. The launch in this case is initiated by the slave, thus slaves need not be IP reachable from the master (e.g. behind the firewall). This launch method is supported on *nix and Windows platforms.\n- **SSH** - Jenkins has a built-in SSH client implementation that it can use to talk to remote `sshd` daemon and start a slave agent. This is the most convenient and preferred method for Unix slaves, which normally has `sshd` out-of-the-box.\n\nThe `jenkins_slave` resource is actually the base resource for several resources that map directly back to a launch method:\n\n- `jenkins_jnlp_slave` - As JNLP Slave connections are slave initiated, this resource should be part of a **slave**'s run list.\n- `jenkins_ssh_slave` - As SSH Slave connections are master initiated, this resource should be part of a **master**'s run list.\n\nThe `:create` action idempotently creates a Jenkins slave on the master. The name attribute corresponds to the name of the slave (which is also used to uniquely identify the slave).\n\n```ruby\n# Create a basic JNLP slave\njenkins_jnlp_slave 'builder' do\n  description 'A generic slave builder'\n  remote_fs   '/home/jenkins'\n  labels      ['builder', 'linux']\nend\n\n# Create a slave launched via SSH\njenkins_ssh_slave 'executor' do\n  description 'Run test suites'\n  remote_fs   '/share/executor'\n  labels      ['executor', 'freebsd', 'jail']\n\n  # SSH specific attributes\n  host        '172.11.12.53' # or 'slave.example.org'\n  user        'jenkins'\n  credentials 'wcoyote'\n  launch_timeout   30\n  ssh_retries      5\n  ssh_wait_retries 60\nend\n\n# A slave's executors, usage mode and availability can also be configured\njenkins_jnlp_slave 'smoke' do\n  description     'Runs a series of high-level smoke tests'\n  remote_fs       '/home/jenkins'\n  executors       5\n  usage_mode      'exclusive'\n  availability    'demand'\n  in_demand_delay 1\n  idle_delay      3\n  labels          ['runner', 'fast']\nend\n\n# Create a slave with a full environment\njenkins_jnlp_slave 'integration' do\n  description 'Runs the high-level integration suite'\n  remote_fs   '/home/jenkins'\n  labels      ['integration', 'rails', 'ruby']\n  environment(\n    RAILS_ENV: 'test',\n    GCC:       '1_000_000_000'\n  )\nend\n\n# Windows JNLP slave\njenkins_windows_slave 'mywinslave' do\n  remote_fs 'C:/jenkins'\n  user       '.\\Administrator'\n  password   'MyPassword'\nend\n```\n\nThe `:delete` action idempotently removes a slave from the cluster. Any services used to manage the underlying slave process will also be disabled.\n\n```ruby\njenkins_jnlp_slave 'builder' do\n  action :delete\nend\n\njenkins_ssh_slave 'executor' do\n  action :delete\nend\n```\n\nThe `:connect` action idempotently forces the master to reconnect to the specified slave. You can use the base `jenkins_slave` resource or any of its children to perform the connection.\n\n```ruby\njenkins_slave 'builder' do\n  action :connect\nend\n\njenkins_ssh_slave 'executor' do\n  action :connect\nend\n```\n\nThe `:disconnect` action idempotently forces the master to disconnect the specified slave. You can use the base `jenkins_slave` resource or any of its children to perform the connection.\n\n```ruby\njenkins_slave 'builder' do\n  action :disconnect\nend\n\njenkins_ssh_slave 'executor' do\n  action :disconnect\nend\n```\n\nThe `:online` action idempotently brings a slave back online. You can use the base `jenkins_slave` resource or any of its children to bring the slave online.\n\n```ruby\njenkins_slave 'builder' do\n  action :online\nend\n\njenkins_ssh_slave 'executor' do\n  action :online\nend\n```\n\nThe `:offline` action idempotently takes a slave temporarily offline. An optional reason for going offline can be provided with the `offline_reason` attribute. You can use the base `jenkins_slave` resource or any of its children to take a slave offline.\n\n```ruby\njenkins_slave 'builder' do\n  action :offline\nend\n\njenkins_ssh_slave 'executor' do\n  offline_reason 'ran out of energon'\n  action :offline\nend\n```\n\n**NOTE** It's worth noting the somewhat confusing differences between _disconnecting_ and _off-lining_ a slave:\n\n- **Disconnect** - Instantly closes the channel of communication between the master and slave. Currently executing jobs will be terminated immediately. If a slave is configured with an availability of `always` the master will attempt to reconnect to the slave.\n- **Offline** - Keeps the channel of communication between the master and slave open. Currently executing jobs will be allowed to finish, but no new jobs will be scheduled on the slave.\n\n### jenkins_user\n\n**NOTE** The use of the Jenkins user resource requires the Jenkins mailer plugin. This plugin is not shipped by default in jenkins 2.x.\n\nThis resource manages Jenkins users, supporting the following actions:\n\n```\n:create, :delete\n```\n\nThis uses the Jenkins groovy API to create users.\n\nThe `:create` action idempotently creates a Jenkins user on the current node. The id attribute corresponds to the username of the id of the user on the target node. You may also specify a name, email, and list of SSH keys.\n\n```ruby\n# Create a Jenkins user\njenkins_user 'grumpy'\n\n# Create a Jenkins user with specific attributes\njenkins_user 'grumpy' do\n  full_name    'Grumpy Dwarf'\n  email        'grumpy@example.com'\n  public_keys  ['ssh-rsa AAAAB3NzaC1y...']\nend\n```\n\nThe `:delete` action removes a Jenkins user from the system.\n\n```ruby\njenkins_user 'grumpy' do\n  action :delete\nend\n```\n\n## Caveats\n\n### Authentication\n\nIf you use or plan to use authentication for your Jenkins cluster (which we highly recommend), you will need to set a special value in the `run_context`:\n\n```ruby\nnode.run_state[:jenkins_private_key]\n```\n\nThe underlying executor class (which all HWRPs use) intelligently adds authentication information to the Jenkins CLI commands if this value is set. The method used to generate and populate this key-pair is left to the user:\n\n```ruby\n# Using search\nmaster = search(:node, 'fqdn:master.ci.example.com').first\nnode.run_state[:jenkins_private_key] = master['jenkins']['private_key']\n\n# Using encrypted data bags and chef-sugar\nprivate_key = encrypted_data_bag_item('jenkins', 'keys')['private_key']\nnode.run_state[:jenkins_private_key] = private_key\n```\n\nThe associated public key must be set on a Jenkins user. You can use the `jenkins_user` resource to create this pairing. Here's an example that loads a keypair and assigns it appropriately:\n\n```ruby\njenkins_keys = encrypted_data_bag_item('jenkins', 'keys')\n\nrequire 'openssl'\nrequire 'net/ssh'\n\nkey = OpenSSL::PKey::RSA.new(jenkins_keys['private_key'])\nprivate_key = key.to_pem\npublic_key = \"#{key.ssh_type} #{[key.to_blob].pack('m0')}\"\n\n# Create the Jenkins user with the public key\njenkins_user 'chef' do\n  public_keys [public_key]\nend\n\n# Set the private key on the Jenkins executor\nnode.run_state[:jenkins_private_key] = private_key\n```\n\nPlease note that older versions of Jenkins (< 1.555) permitted login via CLI for a user defined in Jenkins configuration with an SSH public key but not present in the actual SecurityRealm, and this is no longer permitted. If an operation requires any special permission at all, you must authenticate as a real user. This means that if you have LDAP or GitHub OAuth based authn/authz enabled the user you are using for configuration tasks must have an associated account in the external services. Please see [JENKINS-22346](https://issues.jenkins-ci.org/browse/JENKINS-22346) for more details.\n\nIf (and **only if**) you have your Jenkins instance configured to use the PAM (Unix user/group database) security realm you can set the username and password the CLI uses via these two `run_context` values:\n\n```ruby\nnode.run_state[:jenkins_username]\nnode.run_state[:jenkins_password]\n```\n\n### Jenkins 2\n\nJenkins 2 enables an install wizard by default. To make sure you can manipulate the jenkins instance, you need to disable the wizard. You can do this by setting an attribute:\n\n```ruby\ndefault['jenkins']['master']['jvm_options'] = '-Djenkins.install.runSetupWizard=false'\n```\n\nThis is done by default, but must be kept when overriding the jvm_options!\n\n### Proxies\n\nIf you need to pass through a proxy to communicate between your masters and slaves, you will need to set a special node attribute:\n\n```ruby\nnode['jenkins']['executor']['proxy']\n```\n\nThe underlying executor class (which all HWRPs use) intelligently passes proxy information to the Jenkins CLI commands if this attribute is set. It should be set in the form `HOST:PORT`:\n\n```ruby\nnode.normal['jenkins']['executor']['proxy'] = '1.2.3.4:5678'\n```\n\n## Development\n\nPlease see the [Contributing](CONTRIBUTING.md) and [Testing](TESTING.md) Guidelines.\n\n## License & Authors\n\n- Author: Seth Vargo [sethvargo@gmail.com](mailto:sethvargo@gmail.com)\n- Author: Seth Chisamore [schisamo@chef.io](mailto:schisamo@chef.io)\n- Original Author: Doug MacEachern [dougm@vmware.com](mailto:dougm@vmware.com)\n- Contributor: AJ Christensen [aj@junglist.gen.nz](mailto:aj@junglist.gen.nz)\n- Contributor: Fletcher Nichol [fnichol@nichol.ca](mailto:fnichol@nichol.ca)\n- Contributor: Roman Kamyk [rkj@go2.pl](mailto:rkj@go2.pl)\n- Contributor: Darko Fabijan [darko@renderedtext.com](mailto:darko@renderedtext.com)\n\n```text\nCopyright 2010 VMware, Inc.\nCopyright 2011 Fletcher Nichol\nCopyright 2013-2016 Chef Software, Inc.\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n```\n","maintainer":"Chef Software, Inc.","maintainer_email":"cookbooks@chef.io","license":"Apache-2.0","platforms":{"ubuntu":">= 0.0.0","debian":">= 0.0.0","redhat":">= 0.0.0","centos":">= 0.0.0","scientific":">= 0.0.0","oracle":">= 0.0.0","amazon":">= 0.0.0"},"dependencies":{"runit":">= 1.7","compat_resource":">= 12.16.3","dpkg_autostart":">= 0.0.0"},"recommendations":{},"suggestions":{},"conflicting":{},"providing":{},"replacing":{},"attributes":{},"groupings":{},"recipes":{"jenkins::master":"Installs a Jenkins master"},"source_url":"https://github.com/chef-cookbooks/jenkins","issues_url":"https://github.com/chef-cookbooks/jenkins/issues","chef_version":[[">= 12.1"]],"ohai_version":[]}